In [ ]:
import sqlite3
import pandas as pd

In [ ]:
db_dir = 'chinook.db'
conn = sqlite3.connect(db_dir)

In [ ]:
query4 = """
SELECT c.FirstName "Cliente", c.Country, e.FirstName "Empleado", i.Total
FROM invoices i
JOIN customers c ON i.customerId = c.customerId
JOIN employees e ON e.EmployeeId = c.supportRepId
"""
pd.read_sql_query(query4, conn)

    Cliente Country Empleado  Total
0      Luís  Brazil     Jane   3.98
1      Luís  Brazil     Jane   3.96
2      Luís  Brazil     Jane   5.94
3      Luís  Brazil     Jane   0.99
4      Luís  Brazil     Jane   1.98
..      ...     ...      ...    ...
407    Puja   India     Jane   5.94
408    Puja   India     Jane   1.99
409    Puja   India     Jane   1.98
410    Puja   India     Jane  13.86
411    Puja   India     Jane   8.91

[412 rows x 4 columns]

In [ ]:
query5 = """
SELECT *
FROM tracks t
JOIN invoice_items ii ON ii.trackId
JOIN invoices i ON i.invoiceId = ii.invoiceId
"""
pd.read_sql_query(query5, conn)

In [ ]:
query7 = """
SELECT p.Name, COUNT(*)
FROM playlists p
JOIN playlist_track pt ON p.PlaylistId = pt.PlaylistId
GROUP BY p.PlaylistId
"""

In [ ]:
pd.read_sql_query(query7, conn)

                          Name  COUNT(*)
0                        Music      3290
1                     TV Shows       213
2                   90’s Music      1477
3                        Music      3290
4                 Music Videos         1
5                     TV Shows       213
6              Brazilian Music        39
7                    Classical        75
8    Classical 101 - Deep Cuts        25
9   Classical 101 - Next Steps        25
10  Classical 101 - The Basics        25
11                      Grunge        15
12         Heavy Metal Classic        26
13                 On-The-Go 1         1

In [ ]:
query8 = """
SELECT e.FirstName, SUM(i.Total) "Ventas"
FROM employees e
LEFT JOIN customers c ON e.EmployeeId = c.SupportRepId
LEFT JOIN invoices i ON i.CustomerID = c.CustomerID
GROUP BY e.EmployeeId
"""
pd.read_sql_query(query8, conn)

  FirstName  Ventas
0    Andrew     NaN
1     Nancy     NaN
2      Jane  833.04
3  Margaret  775.40
4     Steve  720.16
5   Michael     NaN
6    Robert     NaN
7     Laura     NaN

In [ ]:
query9 = """
SELECT e.FirstName, SUM(i.Total) "Ventas"
FROM employees e
LEFT JOIN customers c ON e.EmployeeId = c.SupportRepId
LEFT JOIN invoices i ON i.CustomerID = c.CustomerID
WHERE i.InvoiceDate LIKE "2009%"
GROUP BY e.EmployeeId
ORDER BY Ventas DESC
LIMIT 1
"""
pd.read_sql_query(query9, conn)

  FirstName  Ventas
0     Steve  164.34

In [ ]:
query10 = """
SELECT AR.nAME, SUM(ii.UnitPrice) "Ventas"
FROM artists ar
JOIN albums al ON al.artistId = ar.artistID
JOIN tracks t ON al.albumId = t.albumId
JOIN invoice_items ii ON t.trackId = ii.trackId
GROUP BY ar.ArtistId
ORDER BY Ventas DESC
LIMIT 3
"""
pd.read_sql_query(query10, conn)